Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: །བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་གྱི་ཁ་དོག་དང་གཟུགས་ཀྱི་གློང་དང་རྒྱན་གྲངས་མེད་པ་ཅན་དགོས་པ་སྣ་ཚོགས་གྲངས་མེད་པ་ལ་སྟ་གོན་དུ་གནས་པ། སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་སྟེ།
en: Sudhana also saw issuing forth from all of Sāgara­dhvaja’s pores, from each of his pores, fields of networks of light rays that were as numerous as the atoms in countless buddha realms, were filling the ten directions of the realm of phenomena, and formed countless arrays of powers and adopted forms prepared to carry out countless different activities.

source: འདི་ལྟར་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྦྱིན་པའི་སྤྱོད་པ་སྐྱོན་མེད་པས། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་།
en: Sudhana saw some of the fields of networks of light rays from the pores performing the miracle of giving away all possessions through a faultless conduct of generosity.

source: །བ་སྤུའི་སྒོའི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་དུས་གསུམ་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་དང་། ཡི་དམ་དང་ཚུལ་ཁྲིམས་ཀྱི་དཀྱིལ་འཁོར་དུ་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་།
en: Sudhana saw some of the fields of networks of light rays from the pores manifesting the field of the correct conduct, discipline, commitment, and precepts of the bodhisattvas of the three times.

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བཟོད་པའི་སྤྱོད་པའི་རྣམ་པ་དུས་གསུམ་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྐ་ལག་དང་། ཡན་ལག་གི་དམ་པ་བཅད་ཀྱང་ཉམས་སུ་བཟོད་པ་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁུ་ཚུར་དང་དབྱིག་པས་བསྣུན་ཏེ།
en: Sudhana saw some of the fields of networks of light rays from the pores manifesting the forms of the conduct of patience of the bodhisattvas in the three times. They manifested them enduring their hands, feet, and heads being cut off.

source: མཚོན་གྱིས་ལུས་ལ་བཏབ་ཀྱང་ཉམས་སུ་བཟོད་པར་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ལུས་ཐམས་ཅད་གཤེགས་སམ།
en: They manifested them enduring their bodies being beaten with fists and sticks and struck by weapons.

source: སྙིང་དང་མྱིག་ཕྱུང་ཡང་ཉམས་སུ་བཟོད་པ་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་།
en: They manifested them enduring their bodies being cut apart or their hearts and eyes being plucked out.

source: །བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་དུ་བྱུང་བ་རྣམ་པར་བརྟགས་པའི་ལུས་དང་ལྡན་པ་གཞན་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཙལ་བའི་ཆེད་དུ་ལུས་དང་། སེམས་ལ་གནོད་པ་ཐམས་ཅད་དང་ཡན་ལག་དང་ཉིང་ལག་བཅད་པ་ཐམས་ཅད་ཀྱང་སྙིང་རྗེ་ཆེན་པོས་དབང་དུ་བྱས་པའི་ཕྱིར་ཉམས་སུ་བཟོད་པར་བྱས་པ་དང་། བག་ལ་ཞ་བར་བྱས་པ་དང་བཏང་སྙོམས་སུ་བཞག་པའི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་སྤྱོད་པ་རྣམ་པར་འཕྲུལ་པའི་གཟུགས་བརྙན་གྱི་གཟུགས་དེ་ལྟ་བུ་དག་ཀྱང་མཐོང་ངོ་།
en: Sudhana saw the manifestation of forms of the images of the conduct of patience of all bodhisattvas: the formed appearances of other bodhisattvas appearing in the three times who, in seeking omniscience with great compassion, were enduring, forbearing, and indifferent to physical and mental torments and to their limbs and the smaller parts of their bodies being cut off. Sudhana saw some of the fields of networks of light rays from the pores manifesting the different separate forms of the conduct of diligence of all bodhisattvas:

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་རྣམ་པར་ཕྱེ་བའི་གཟུགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱོད་པ་དང་རྒྱ་མཚོ་ཡོངས་སུ་བསྐྱོད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྐྱོ་བར་བྱ་བ་དང་། མུ་སྟེགས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚར་གཅད་པ་དང་། བདུད་ཐམས་ཅད་སྤ་དགོང་བ་དང་། ཆོས་ཀྱི་ཕྱོགས་སྣང་བར་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོར་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་།
en: the manifestations of the diligence of the bodhisattvas of the past, future, and present making worlds tremble, agitating the oceans, causing beings to be dismayed with saṃsāra, terrifying all tīrthikas, causing the hordes of māras to flee, and illuminating the aspects of the Dharma. Sudhana also saw some of the fields of networks of light rays from the pores manifesting all the many kinds of bodhisattva conduct that are performed: all their choosing of an existence; their being born into a family; their formation of a body; their being taught by kalyāṇamitras; the locations for their practicing the instructions of the kalyāṇamitra; the temples, locations, aerial palaces, lands, or mountain caves that are favorable for the practice of the aspects of the meditation of the tathāgatas;

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྣམ་པར་རྒྱུ་བའི་རྣམ་གྲངས་ཇི་སྙེད་པ་དང་ལུས་ཉེ་བར་ལེན་པ་ཇི་སྙེད་པ་དང་། རིགས་སུ་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བ་ཅི་སྙེད་པ་དང་། གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་གྲུབ་པ་ཇི་སྙེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྗེས་སུ་བསྟན་པ་ཡོངས་སུ་བཟུང་བ་ཇི་སྙེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་མན་ངག་ལ་ནན་ཏན་དུ་བྱ་བའི་གནས་ཇི་སྙེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་ཡན་ལག་ཡོངས་སུ་བསྒྲུབ་པ་དང་། འཐུན་པའི་གཙུག་ལག་ཁང་དང་། གནས་དང་། གཞལ་མེད་ཁང་དང་། ཡུལ་དང་། རིའི་སུ་ལ་ཇི་སྙེད་པ་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་སུས་ཡོངས་སུ་བསྒྲུབ་པའི་དྲང་སྲོང་གི་ལུས་ཇི་སྙེད་པ་དང་། རྒྱལ་པོའི་ཐབས་ཇི་སྙེད་པ་དང་། འབྱུང་བ་ལ་མངོན་པར་མོས་པ་ཇི་སྙེད་པ་དང་། བརྟུལ་ཞུགས་དང་ཡི་དམ་དང་། ཚུལ་དང་སྤྱོད་ལམ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ལ་རྣམ་པར་སྤྱོད་ཅིང་།
en: their physical forms as ṛṣis in which they accomplish those aspects of meditation; their ruling as kings; their aspiration for renunciation; and the discipline, commitment, and precepts of their path of mendicancy. Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the practice of the conduct of the perfection of wisdom.

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་དང་ལྡན་པའི་ལུས་ཡོངས་སུ་བཟུང་བ་མཐོང་སྟེ། ལུས་གང་གིས་ཆོས་ཀྱི་ཚིག་གཅིག་གི་དོན་དུ་ཡང་བ་དོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལས་ཡོངས་སུ་བཙལ་བ་དང་རིམ་གྲོ་དང་། བཀུར་སྟི་ཐམས་ཅད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལས་ཡོངས་སུ་བཙལ་བ་དང་། དད་པ་དང་སྲི་ཞུས་ལུས་རབ་ཏུ་བཏུད་དེ།
en: He saw the acquisitions of a body for seeking all the Dharma, in those bodies giving up all possessions for the sake of a single word of the Dharma, seeking that single word from all beings, seeking it from all kalyāṇamitras with service and respect, and seeking it from all the tathāgatas with faith, veneration, and bowing down the body.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་ཡོངས་སུ་བཙལ་བ་དང་། ཆོས་ཀྱི་ཚིག་གཅིག་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚིག་ཐམས་ཅད་ལའང་དེ་བཞིན་ཏེ།
en: Just as they do for a single word of the Dharma, they do the same for all the words of the Dharma that have the perfection of wisdom of the tathāgatas, seeking them with the apparent image of a body appearing among all beings.

source: འགྲོ་བ་ཐམས་ཅད་དུ་གཟུགས་བརྙན་བྱུང་བའི་ལུས་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་བཙལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བ་སྤུའི་སྒོ་གཅིག་གི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་ལས་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཐབས་འགྲོ་བའི་རྒྱུད་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འབྱམ་ཀླས་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྦྱོར་བར་མཐོང་ངོ་། །སེམས་ཅན་རེ་རེ་ལ་ཡང་ལུས་དང་སྤྱོད་པའི་ཚུལ་གྱི་སྒོ།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the methods of all bodhisattvas for ripening beings, for gathering as pupils all beings, and he saw the entire vast extent of the ocean of beings.

source: སྔོན་གྱི་ལུས་ཉེ་བར་བླངས་པ་ཐབས་མཁས་པའི་སྤྱོད་པ་ལ་བརྩོན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་འདྲ་བས་ཡོངས་སུ་སྡུད་པ་ཡང་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་གཅིག་ལས་མཐོང་ངོ་།
en: He saw the dedication to the conduct of skillful methods in their previous lifetimes, how they gathered pupils through having a body that was the same as that of each and every being.

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྔོན་བཅོམ་ལྡན་འདས་ཀྱི་བསྐལ་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྤྱོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྤྱོད་པ་དང་། ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པ་མཛད་པ་ཇི་སྙེད་པ་དང་། སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབས་པའི་དཀྱིལ་འཁོར་ཇི་སྙེད་ཅིག་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་གི་ཞབས་ཀྱི་དྲུང་དུ་འཁོར་བའི་སྐྱོན་ཐམས་ཅད་ལས་སོ་སོའི་རེ་རེའི་གཉེན་པོར་མངོན་པར་བསྒྲུབས་པར་མཛད་པ།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the conduct that accomplishes the prayers of all the bhagavats in the past kalpas, the conduct that accomplishes the prayers for ripening all beings, and the conduct that accomplishes the prayers for purifying all realms. Within the field of the accomplishment of those prayers they accomplished the remedy for each fault of saṃsāra at the feet of this and that tathāgata.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་གཅིག་ལས་མཐོང་ངོ་།
en: Sudhana, the head merchant’s son, saw all of these manifesting from each single field of networks of light rays from a pore.

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཐམས་ཅད་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐོང་ངོ་།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting an ocean of all the past conduct of the perfection of strength.

source: །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་རྣམ་པར་རྒྱུ་བ་ཐམས་ཅད་དང་ལྡན་པ་མི་ཤེས་པའི་གཉིད་ཀྱིས་ལོག་པའི་སེམས་ཅན་སད་པར་བྱེད་པའི་རང་བཞིན་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐོང་བར་གྱུར་ཏོ།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting an ocean of all the past practice of the conduct of wisdom that has the nature of awaking beings from the sleep of ignorance.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་དེ་ལྟར་མཉམ་པར་བཞག་པ་ལ་སེམས་ཤིང་རྟོག་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་ལ་རྗེས་སུ་རྣམ་པར་བསམ་པ་དང་། སེམས་ཅན་གྱི་དོན་གྱི་ཚུལ་རྒྱ་མཚོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། མངོན་པར་འདུ་བྱ་བའི་སྒོ་རྒྱུད་ཀུན་ལ་མངོན་དུ་གནས་པའི་རྒྱན་དེའི་རྗེས་སུ་འབྲང་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་རྒྱན་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་མནོད་པའི་ཡེ་ཤེས་དེ་ལ་རབ་ཏུ་བརྟག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་གི་སྟོབས་དེ་ཡོངས་སུ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སྟོབས་དེ་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྟོབས་དེ་ཤིན་ཏུ་རྒྱས་པར་བྱ་བ་བྱེད་ཅིང་།
en: Sudhana, the head merchant’s son, thus observed and examined the bhikṣu Sāgara­dhvaja resting in meditation. He was mindful of the field of liberation of samādhi; he was contemplating the inconceivable, supreme power of bodhisattva samādhi; he was comprehending that inconceivable ocean of ways to benefit beings; he was following and was devoted to that inconceivable, complete display of the composite gateways for entry into those streams of conduct; he was entering through the gateway to the pure wisdom of the display of the realm of phenomena; he was examining the wisdom that is received through the blessing of the buddhas; he was developing the strength of those bodhisattva powers; he was making firm the strength of those bodhisattva prayers; and he was increasing the strength of that bodhisattva conduct.

source: དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་མདུན་དུ་ཉིན་ཞག་གཅིག་ཀྱང་ལོན་ནོ།
en: In that way, he sat before the bhikṣu Sāgara­dhvaja for an entire day and night.

source: །ཉིན་ཞག་གཉིས་དང་བདུན་ཡང་ལོན་ནོ། །ཟླ་བ་ཕྱེད་དང་ཟླ་བ་གཅིག་དང་། ཟླ་བ་གཉིས་དང་ཟླ་བ་དྲུག་གི་བར་དང་། ཉིན་ཞག་ཀྱང་དྲུག་ཏུ་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་མདུན་དུ་ལོན་ཏེ།
en: He sat before the bhikṣu Sāgara­dhvaja for two days, for seven days, for half a month, for a whole month, for two months, for six months, and for another six days and nights.

source: དེ་ལྟར་ཟླ་བ་དྲུག་དང་། ཉིན་ཞག་དྲུག་འདས་ནས་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་སོ། །དེ་ནས་ནོར་བཟངས་ཀྱིས་སྨྲས་པ།
en: When six months and six days had passed, the bhikṣu Sāgara­dhvaja arose from his samādhi.

source: འཕགས་པ་ཏིང་ངེ་འཛིན་འདི་དེ་ལྟར་ཟབ་ལ།
en: Then Sudhana said to him, “Ārya, this wonderful samādhi that is so profound; that is so vast; that has such an immeasurable scope; that has such an inconceivable manifestation; that has such an unequaled radiance;

source: དེ་ལྟར་རྒྱ་ཆེ་ཞིང་དེ་ལྟར་ཚད་མ་མཆིས་པའི་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་ལྡན་པ་དང་། དེ་ལྟར་སྣང་བ་མཚུངས་པ་མ་མཆིས་པ་དང་། དེ་ལྟར་གྲངས་མ་མཆིས་པའི་རྒྱན་དང་ལྡན་པ་དང་། དེ་ལྟར་མི་འཕྲོགས་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་མ་འདྲེས་པའི་ཡུལ་དང་ལྡན་པ་དང་། དེ་ལྟར་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བ་དང་། ཏིང་ངེ་འཛིན་འདི་དེ་ལྟར་སེམས་ཅན་གྱི་དོན་ཚད་མ་མཆིས་པ་རབ་ཏུ་སྒྲུབ་པར་གྱུར་པ་ནི་ངོ་མཚར་ཏེ།
en: that has such innumerable displays; that has such an inviolable range; that has such an unalloyed scope; that has such a universal illumination; that has such an accomplishment of benefit for limitless beings;

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཚད་མ་མཆིས་པ་རྣམ་པར་ཞི་བར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་པ་སྟེ།
en: that brings such a cessation of the measureless sufferings of all beings;

source: འདི་ལྟར་དབུལ་བའི་སྡུག་བསྔལ་ཞི་བར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་སོ།
en: that is present in order to end the sufferings of poverty;

source: །སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་རྒྱུན་བཅད་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ལས་ཡོངས་སུ་བསྐྱབ་པ་དང་། མི་ཁོམ་པའི་ལམ་གྱི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་གཅད་པ་དང་། མཐོ་རིས་ཀྱི་ལམ་གྱི་རྒྱུད་དུ་ཕྱིན་པར་བགྱི་བ་དང་། ལྷ་དང་མིའི་དགའ་བ་དང་། བདེ་བ་འབྱུང་བར་བགྱི་བ་དང་། བསམ་གཏན་གྱི་ཡུལ་གྱིས་དགའ་བ་ཉམས་སུ་མྱོང་བར་བགྱི་བ་དང་། འདུས་བྱས་ལ་སྤྱོད་པའི་བདེ་བ་ཡོངས་སུ་འཕེལ་བར་བགྱི་བ་དང་། ཁམས་གསུམ་པ་ལས་འབྱུང་བའི་སྒོ་ཡོངས་སུ་བསྟན་པ་ལ་སྟ་གོན་དུ་གནས་སོ། བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་སྐྱེ་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་ལ་སྟ་གོན་དུ་གནས་སོ། །བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡང་དག་པར་སྐྱེ་བའི་རྒྱུ་རྣམ་པར་འཕེལ་བར་བགྱི་བ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཤུགས་རྒྱ་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བགྱི་བ་དང་། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་ཡོངས་སུ་བསྐྱེད་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བགྱི་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོའི་ཐེག་པ་རྣམ་པར་དགོད་པ་དང་། ཐེག་པ་ཆེན་པོའི་ཁྱད་པར་ལ་འཇུག་པ་མངོན་པར་བསྒྲུབ་པ་དང་། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཤེས་ཤིང་སྣང་བར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཤེས་ཤིང་སྣང་བ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་སྤྱོད་པ་དང་། འབྱུང་བའི་རྒྱན་རྣམ་པར་དག་པ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ས་གནན་པ་ལ་ཐོགས་པ་མ་མཆིས་པར་བགྱི་བ་ལ་སྟ་གོན་དུ་གནས་པའོ། །འཕགས་པ་ཏིང་ངེ་འཛིན་དེའི་མིང་ཅི་ཞེས་བགྱི་སྨྲས་པ།
en: that is present in order to save beings from existences of rebirth as animals, in order to close all the gateways that lead to unfortunate existences, in order to lead onto the path to higher existences, in order to bring the joy and happiness of devas and humans, in order to bring the experience of joy within the scope of meditation, in order to increase joy in composite conduct, and in order to show the gateway to escape from the three realms that is present in order to illuminate the causes for the creation of the aspiration to enlightenment, to increase the causes for generating the accumulations of merit and wisdom, to increase the vast power of great compassion, to develop the strength of great prayers, to attain the illumination of the path of the bodhisattvas, to establish the yāna of the perfections, to accomplish entry into the exceptional Mahāyāna, to know and illuminate the completely good conduct, to know and attain the illumination of the bodhisattva bhūmi, to accomplish the prayers, conduct, and pure-emergence displays of all the bodhisattvas; and that becomes present in order to ascend without impediment to the level of omniscience—Ārya, what is the name of this samādhi?”

source: རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ནས་ལྟ་བའི་བཏང་སྙོམས་ཡོངས་སུ་ཐོབ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: The bhikṣu Sāgara­dhvaja answered, “Noble one, it is the perfection of wisdom called the complete vision of the attainment of equanimity

source: ཏིང་ངེ་འཛིན་འདི་ནི་དེའི་སྣང་བ་སྟེ། སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ཅེས་བྱའོ།
en: The radiance of that samādhi is called the pure display of every gateway

source: །རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཀུན་ནས་ལྟ་བའི་བཏང་སྙོམས་རབ་ཏུ་ཐོབ་པའི་སྣང་བ་ལས་སྐྱེས་པའི་ཏིང་ངེ་འཛིན་སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ཅེས་བྱ་བ་འདི་ཤིན་ཏུ་བསྒོམས་ན་སྒོ་ཀུན་ནས་རྣམ་པར་དག་པའི་རྒྱན་ལ་སྩོགས་པ་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ཚང་བ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་རོ། །སྨྲས་པ།
en: “Noble one, if you meditate on the pure display of every gateway samādhi that arises from attaining the radiance of the perfection of wisdom called the complete vision of the attainment of equanimity , then you will accomplish ten times countless hundreds of thousands of samādhis such as the pure display of every gateway

source: འཕགས་པ་ཏིང་ངེ་འཛིན་འདིའི་ཡུལ་དེར་བས་སམ་མ་བས།
en: Sudhana asked, “Ārya, what is the range of this samādhi?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་པ་ལ་ནི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དམིགས་པ་ལ་ཐོགས་པ་མེད་དོ།
en: The bhikṣu Sāgara­dhvaja answered, “Noble one, if you rest in this samādhi, you will have no impediment in perceiving world realms;

source: །འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇུག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in entering those world realms;

source: །འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་གནོན་པ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in overpowering those world realms;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་བརྒྱན་པ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in adorning those world realms;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་སྦྱང་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in cleansing those world realms;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in purifying those world realms;

source: །སངས་རྒྱས་བལྟ་ཞིང་རྣམ་པར་དམིགས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in perceiving and looking at the buddhas;

source: །སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེ་བ་བརྟག་པ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in examining the greatness of the buddhas;

source: །སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in knowing the miracles of the buddhas;

source: །སངས་རྒྱས་ཀྱི་སྟོབས་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in comprehending and understanding the strengths of the buddhas;

source: །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོར་འཇུག་པ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in comprehending the ocean of the qualities of the buddhas;

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་གཟུང་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in obtaining the rain of the Dharma clouds of the buddhas;

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་མ་འདྲེས་པ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in knowing and understanding distinctly the Dharma wheels of the buddhas;

source: །སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in comprehending and understanding the ocean of the circles of followers of the buddhas;

source: །ཕྱོགས་བཅུར་འཇུག་ཅིང་རྗེས་སུ་བགྲང་བར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in comprehending and following the ten directions;

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པ་རྗེས་སུ་བརྟག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in examining the Dharma taught by the buddhas;

source: །སངས་རྒྱས་ཀྱི་ཕྱོགས་རྗེས་སུ་བརྟག་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in examining the directions of the buddhas;

source: །སྙིང་རྗེ་ཆེན་པོའི་ཕྱོགས་རྣམ་པར་མི་སྤང་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in never abandoning the direction of great compassion;

source: །བྱམས་པས་ཕྱོགས་རྒྱས་པར་དགང་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in filling the directions with great love;

source: །སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་ལ་འཇུག་པས་མི་ངོམས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in never tiring of the direction of gazing at the buddhas; you will have no impediment in comprehending and understanding all of the ocean of the buddhas;

source: །སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in knowing and understanding all of the ocean of beings;

source: །སེམས་ཅན་གྱི་དབང་པོ་རྒྱ་མཚོ་ཐམས་ཅད་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: you will have no impediment in knowing and understanding all of the ocean of the faculties of beings;

source: །སེམས་ཅན་གྱི་དབང་པོ་ཐ་དད་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བ་ལ་ཐོགས་པ་མེད་དོ།
en: and you will have no impediment in knowing all the different faculties of beings.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་འདི་ཤེས་སུ་ཟད་ན།
en: “Noble one, I know only this conduct of the perfection of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་ལ་བློ་གྲོས་རྣམ་པར་དག་པ།
en: How could I know or describe the qualities of, teach the conduct of, describe the scope of, praise the strength of the great prayers of, illuminate the gateway for the emergence of, describe the true accomplishment of, teach the path of, follow the continuum of samādhi of, know the scope of the mind of, or be able to comprehend the equanimity of the wisdom of the entry by the bodhisattvas in the ocean of the conduct of the perfection of wisdom?

source: ཆོས་ཐམས་ཅད་ལ་རིག་པ་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་ཅན། བློ་ཤིན་ཏུ་ཡངས་པས་ཚད་མེད་པའི་ཡུལ་རྒྱས་པར་འགེངས་པ་གཟུངས་ཆེན་པོའི་སྣང་བ་ལ་དབང་བསྒྱུར་བ། ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་སྣང་བ་ཐམས་ཅད་ཤིན་ཏུ་དག་པ་མངོན་པར་ཤེས་པ་རྣམ་པར་འགྲུལ་བ་དང་། ཁྱུ་མཆོག་གི་མཐུ་འབྱིན་པ་ལ་ཤིན་ཏུ་བྱུང་བ་སོ་སོ་ཡང་དག་པར་རིག་པ་མི་ཟད་པའི་རྒྱ་མཚོ་ལ་ཞུགས་པ། ངག་སྙན་པ་སའི་སྙིང་པོ་དང་ལྡན་པ་བརྗོད་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྟེན་དུ་གྱུར་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ། སྤྱོད་ཡུལ་བསྟན་པའམ།
en: So too of the pure understanding of the scope of the realm of phenomena, of having the wisdom that follows knowing all phenomena, of pervading the immeasurable field of perception with a vast understanding, of having the power of the radiance of great mental retention, of the purity of the radiance of the field of samādhi, of the emergence of the mighty power of miraculous clairvoyance, of entering an ocean of unceasing discernment, of the sweet voice of the essence of the bodhisattva bhūmi, or of becoming a refuge for all beings.

source: ཡུལ་རབ་ཏུ་བརྗོད་པའམ། སྨོན་ལམ་ཆེན་པོའི་སྟོབས་ཡང་དག་པར་བསྔགས་པའམ། འབྱུང་བའི་སྒོ་ཡོངས་སུ་སྣང་བར་བྱ་བ་འམ། ཡང་དག་པར་བསྒྲུབ་པ་མངོན་པར་བརྗོད་པའམ། ལམ་ཡོངས་སུ་བསྟན་པའམ། ཏིང་ངེ་འཛིན་གྱི་རྒྱུན་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ། སེམས་ཀྱི་ཡུལ་ཤེས་པར་བྱ་བའམ།
en: “Depart, noble one.

source: ཡེ་ཤེས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཕྱོགས་ཀྱི་གནས་རྒྱ་མཚོ་རྣམ་པར་རློབ་པ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཞིག་གྲོང་ཁྱེར་འོད་ཆེན་པོ་ཞེས་བྱ་བའི་ཤར་ཕྱོགས་ལོགས་ན་ཡོད་དེ།
en: In this southern region there is a land called Samudravetāḍī, in which there is a park named Samanta­vyūha to the east of the city Mahāprabhasa.

source: དེ་ན་ཤེད་ལས་སྐྱེས་པའི་རྒྱལ་པོ་འོད་བཟངས་ཀྱི་ཆུང་མ་དགེ་བསྙེན་མ་ཡིད་བཞིན་ཞེས་བྱ་བ་ཡོད་ཀྱིས།
en: There dwells an upāsikā by the name of Āśā, who is the wife of Suprabhasa, a lord over humans.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’
